{
  "Years": [
    {
      "Y3S1": {
        "Computing": [
          {
            "code": "CS2109S",
            "title": "Introduction to AI/ML",
            "generalreview": "http://disq.us/p/3188fkj",
            "image": "https://pbs.twimg.com/media/FSDfnEyUcAEUMSd.jpg:large",
            "prologue": [
              "Going in to this course, I had honestly no better clue of how AI/ML ",
              "works than than layman despite the great amount of recent public exposure. Leaving however, I ",
              "had at least an understanding of the basic motivations of how AI/ML is ",
              "exercised. Let me start with a brief recap of the whole course."
            ],
            "recap": [
              "First, one needs to understand how an artificial agent could answer a simple factual question. Fortunately, this is easy: ",
              "the agent reduces the question to a search problem and \"finds\" the answer in a deterministic manner. Take this query: ",
              "Which movie did Tom Cruise and Nicole Kidman appear in together? How would we program an agent to answer this? "
            ],
            "topic": [""]
          },
          {
            "code": "CS3231",
            "title": "Theory of Computation",
            "generalreview": "http://disq.us/p/3188oot",
            "image": "https://preview.redd.it/51c2i8p9ovy31.png?auto=webp&s=5f1ccf07f0d843b344748912f09d16eb86349691",
            "prologue": [
              "A course unlike any CS course I've done or will ever do. Theory of Computation was all about generalising (rigorously) the computational ",
              "power of the machine. Think: what exactly does it mean for a machine to \"compute\" the answer to a problem? Sure, your Algorithms class ",
              "enumerated and proved to you how certain routines solve certain problems. But how exactly do routines translate in a machine? Probably, your ",
              "Computer Architecture class enlightened you to the data and control paths. Then, your OS class swooped in to give you process abstraction. ",
              "These are obviously crucial, but what lies even further beyond? What is the most general representation of a machine? ",
              "Or indeed, even of a problem that has a specific solution? What exactly can('t) a machine compute? These questions, as an almost historical ",
              "review of computational innovation, are devised and answered by the theory of computing."
            ],
            "recap": [
              "First thing to note: we deal - more generally - in \"languages\" instead of \"problems\", and talk about \"language acceptance\" ",
              "instead of \"problem solving\" (in the traditional, Algorithms, sense). Simply put: a machine is given a \"string\" as an input ",
              "and is asked to verify the string's membership in a specific language. If the machine \"accepts\" only those strings that belong to ",
              "that language (nothing more or less), then it is said to accept the language as a whole. "
            ],
            "topic": [""]
          },
          {
            "code": "CS4226",
            "title": "Internet Architecture",
            "generalreview": "http://disq.us/p/3188z62",
            "image": "https://i.imgflip.com/1rivut.jpg",
            "prologue": [""],
            "recap": [""],
            "topic": [""]
          },
          {
            "code": "CS4234",
            "title": "Optimisation Algorithms",
            "generalreview": "http://disq.us/p/31898gp",
            "image": "https://i.redd.it/vehc07hlgmr81.jpg",
            "prologue": [""],
            "recap": [""],
            "topic": [""]
          }
        ],
        "NUSC": [
          {
            "code": "NHS2076",
            "title": "What can I know?",
            "generalreview": "",
            "image": "https://images7.memedroid.com/images/UPLOADED918/6741d04540036.jpeg",
            "prologue": [""],
            "recap": [""],
            "topic": [""]
          },
          {
            "code": "NEX3003",
            "title": "GEx New York City",
            "generalreview": "",
            "image": "https://www.nevadacurrent.com/wp-content/uploads/2019/04/Gramsci-Foucault-1.jpg",
            "prologue": [""],
            "recap": [""],
            "topic": [""]
          }
        ]
      }
    }
  ]
}
